pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxDom_bf.h
/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI5 */
#define IFX_DOM_PESTAT_PESCI5_OFF (21u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI6 */
#define IFX_DOM_PESTAT_PESCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI6 */
#define IFX_DOM_PESTAT_PESCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI6 */
#define IFX_DOM_PESTAT_PESCI6_OFF (22u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI7 */
#define IFX_DOM_PESTAT_PESCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI7 */
#define IFX_DOM_PESTAT_PESCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI7 */
#define IFX_DOM_PESTAT_PESCI7_OFF (23u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI8 */
#define IFX_DOM_PESTAT_PESCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI8 */
#define IFX_DOM_PESTAT_PESCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI8 */
#define IFX_DOM_PESTAT_PESCI8_OFF (24u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI9 */
#define IFX_DOM_PESTAT_PESCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI9 */
#define IFX_DOM_PESTAT_PESCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI9 */
#define IFX_DOM_PESTAT_PESCI9_OFF (25u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI10 */
#define IFX_DOM_PESTAT_PESCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI10 */
#define IFX_DOM_PESTAT_PESCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI10 */
#define IFX_DOM_PESTAT_PESCI10_OFF (26u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI11 */
#define IFX_DOM_PESTAT_PESCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI11 */
#define IFX_DOM_PESTAT_PESCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI11 */
#define IFX_DOM_PESTAT_PESCI11_OFF (27u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI12 */
#define IFX_DOM_PESTAT_PESCI12_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI12 */
#define IFX_DOM_PESTAT_PESCI12_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI12 */
#define IFX_DOM_PESTAT_PESCI12_OFF (28u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI13 */
#define IFX_DOM_PESTAT_PESCI13_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI13 */
#define IFX_DOM_PESTAT_PESCI13_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI13 */
#define IFX_DOM_PESTAT_PESCI13_OFF (29u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI14 */
#define IFX_DOM_PESTAT_PESCI14_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI14 */
#define IFX_DOM_PESTAT_PESCI14_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI14 */
#define IFX_DOM_PESTAT_PESCI14_OFF (30u)

/** \brief Length for Ifx_DOM_PESTAT_Bits.PESCI15 */
#define IFX_DOM_PESTAT_PESCI15_LEN (1u)

/** \brief Mask for Ifx_DOM_PESTAT_Bits.PESCI15 */
#define IFX_DOM_PESTAT_PESCI15_MSK (0x1u)

/** \brief Offset for Ifx_DOM_PESTAT_Bits.PESCI15 */
#define IFX_DOM_PESTAT_PESCI15_OFF (31u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI0 */
#define IFX_DOM_TIDSTAT_TIDSCI0_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI0 */
#define IFX_DOM_TIDSTAT_TIDSCI0_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI0 */
#define IFX_DOM_TIDSTAT_TIDSCI0_OFF (0u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI1 */
#define IFX_DOM_TIDSTAT_TIDSCI1_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI1 */
#define IFX_DOM_TIDSTAT_TIDSCI1_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI1 */
#define IFX_DOM_TIDSTAT_TIDSCI1_OFF (1u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI2 */
#define IFX_DOM_TIDSTAT_TIDSCI2_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI2 */
#define IFX_DOM_TIDSTAT_TIDSCI2_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI2 */
#define IFX_DOM_TIDSTAT_TIDSCI2_OFF (2u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI3 */
#define IFX_DOM_TIDSTAT_TIDSCI3_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI3 */
#define IFX_DOM_TIDSTAT_TIDSCI3_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI3 */
#define IFX_DOM_TIDSTAT_TIDSCI3_OFF (3u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI4 */
#define IFX_DOM_TIDSTAT_TIDSCI4_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI4 */
#define IFX_DOM_TIDSTAT_TIDSCI4_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI4 */
#define IFX_DOM_TIDSTAT_TIDSCI4_OFF (4u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI5 */
#define IFX_DOM_TIDSTAT_TIDSCI5_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI5 */
#define IFX_DOM_TIDSTAT_TIDSCI5_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI5 */
#define IFX_DOM_TIDSTAT_TIDSCI5_OFF (5u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI6 */
#define IFX_DOM_TIDSTAT_TIDSCI6_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI6 */
#define IFX_DOM_TIDSTAT_TIDSCI6_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI6 */
#define IFX_DOM_TIDSTAT_TIDSCI6_OFF (6u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI7 */
#define IFX_DOM_TIDSTAT_TIDSCI7_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI7 */
#define IFX_DOM_TIDSTAT_TIDSCI7_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI7 */
#define IFX_DOM_TIDSTAT_TIDSCI7_OFF (7u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI8 */
#define IFX_DOM_TIDSTAT_TIDSCI8_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI8 */
#define IFX_DOM_TIDSTAT_TIDSCI8_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI8 */
#define IFX_DOM_TIDSTAT_TIDSCI8_OFF (8u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI9 */
#define IFX_DOM_TIDSTAT_TIDSCI9_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI9 */
#define IFX_DOM_TIDSTAT_TIDSCI9_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI9 */
#define IFX_DOM_TIDSTAT_TIDSCI9_OFF (9u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI10 */
#define IFX_DOM_TIDSTAT_TIDSCI10_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI10 */
#define IFX_DOM_TIDSTAT_TIDSCI10_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI10 */
#define IFX_DOM_TIDSTAT_TIDSCI10_OFF (10u)

/** \brief Length for Ifx_DOM_TIDSTAT_Bits.TIDSCI11 */
#define IFX_DOM_TIDSTAT_TIDSCI11_LEN (1u)

/** \brief Mask for Ifx_DOM_TIDSTAT_Bits.TIDSCI11 */
#define IFX_DOM_TIDSTAT_TIDSCI11_MSK (0x1u)

/** \brief Offset for Ifx_DOM_TIDSTAT_Bits.TIDSCI11 */
#define IFX_DOM_TIDSTAT_TIDSCI11_OFF (11u)

